OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c745.h
extern __at(0x01AA) __sfr BD1OAL;

//==============================================================================
//        BD1IST Bits

extern __at(0x01AC) __sfr BD1IST;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0_BSTALL        : 1;
    unsigned PID1_DTS           : 1;
    unsigned PID2               : 1;
    unsigned PID3               : 1;
    unsigned DATA0_1            : 1;
    unsigned UOWN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0               : 1;
    unsigned PID1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA01             : 1;
    unsigned OWN                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned BSTALL             : 1;
    unsigned DTS                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PID                : 4;
    unsigned                    : 2;
    };
  } __BD1ISTbits_t;

extern __at(0x01AC) volatile __BD1ISTbits_t BD1ISTbits;

#define _BD1IST_PID0_BSTALL     0x04
#define _BD1IST_PID0            0x04
#define _BD1IST_BSTALL          0x04
#define _BD1IST_PID1_DTS        0x08
#define _BD1IST_PID1            0x08
#define _BD1IST_DTS             0x08
#define _BD1IST_PID2            0x10
#define _BD1IST_PID3            0x20
#define _BD1IST_DATA0_1         0x40
#define _BD1IST_DATA01          0x40
#define _BD1IST_UOWN            0x80
#define _BD1IST_OWN             0x80

//==============================================================================


//==============================================================================
//        BD1IBC Bits

extern __at(0x01AD) __sfr BD1IBC;

typedef union
  {
  struct
    {
    unsigned BC0                : 1;
    unsigned BC1                : 1;
    unsigned BC2                : 1;
    unsigned BC3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned BC                 : 4;
    unsigned                    : 4;
    };
  } __BD1IBCbits_t;

extern __at(0x01AD) volatile __BD1IBCbits_t BD1IBCbits;

#define _BD1IBC_BC0             0x01
#define _BD1IBC_BC1             0x02
#define _BD1IBC_BC2             0x04
#define _BD1IBC_BC3             0x08

//==============================================================================

extern __at(0x01AE) __sfr BD1IAL;

//==============================================================================
//        BD2OST Bits

extern __at(0x01B0) __sfr BD2OST;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0_BSTALL        : 1;
    unsigned PID1_DTS           : 1;
    unsigned PID2               : 1;
    unsigned PID3               : 1;
    unsigned DATA0_1            : 1;
    unsigned UOWN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0               : 1;
    unsigned PID1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA01             : 1;
    unsigned OWN                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned BSTALL             : 1;
    unsigned DTS                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PID                : 4;
    unsigned                    : 2;
    };
  } __BD2OSTbits_t;

extern __at(0x01B0) volatile __BD2OSTbits_t BD2OSTbits;

#define _BD2OST_PID0_BSTALL     0x04
#define _BD2OST_PID0            0x04
#define _BD2OST_BSTALL          0x04
#define _BD2OST_PID1_DTS        0x08
#define _BD2OST_PID1            0x08
#define _BD2OST_DTS             0x08
#define _BD2OST_PID2            0x10
#define _BD2OST_PID3            0x20
#define _BD2OST_DATA0_1         0x40
#define _BD2OST_DATA01          0x40
#define _BD2OST_UOWN            0x80
#define _BD2OST_OWN             0x80

//==============================================================================


//==============================================================================
//        BD2OBC Bits

extern __at(0x01B1) __sfr BD2OBC;

typedef union
  {
  struct
    {
    unsigned BC0                : 1;
    unsigned BC1                : 1;
    unsigned BC2                : 1;
    unsigned BC3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned BC                 : 4;
    unsigned                    : 4;
    };
  } __BD2OBCbits_t;

extern __at(0x01B1) volatile __BD2OBCbits_t BD2OBCbits;

#define _BD2OBC_BC0             0x01
#define _BD2OBC_BC1             0x02
#define _BD2OBC_BC2             0x04
#define _BD2OBC_BC3             0x08

//==============================================================================

extern __at(0x01B2) __sfr BD2OAL;

//==============================================================================
//        BD2IST Bits

extern __at(0x01B4) __sfr BD2IST;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0_BSTALL        : 1;
    unsigned PID1_DTS           : 1;
    unsigned PID2               : 1;
    unsigned PID3               : 1;
    unsigned DATA0_1            : 1;
    unsigned UOWN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0               : 1;
    unsigned PID1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA01             : 1;
    unsigned OWN                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned BSTALL             : 1;
    unsigned DTS                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PID                : 4;
    unsigned                    : 2;
    };
  } __BD2ISTbits_t;

extern __at(0x01B4) volatile __BD2ISTbits_t BD2ISTbits;

#define _BD2IST_PID0_BSTALL     0x04
#define _BD2IST_PID0            0x04
#define _BD2IST_BSTALL          0x04
#define _BD2IST_PID1_DTS        0x08
#define _BD2IST_PID1            0x08
#define _BD2IST_DTS             0x08
#define _BD2IST_PID2            0x10
#define _BD2IST_PID3            0x20
#define _BD2IST_DATA0_1         0x40
#define _BD2IST_DATA01          0x40
#define _BD2IST_UOWN            0x80
#define _BD2IST_OWN             0x80

//==============================================================================


//==============================================================================
//        BD2IBC Bits

