OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c745.h
extern __at(0x01B5) __sfr BD2IBC;

typedef union
  {
  struct
    {
    unsigned BC0                : 1;
    unsigned BC1                : 1;
    unsigned BC2                : 1;
    unsigned BC3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned BC                 : 4;
    unsigned                    : 4;
    };
  } __BD2IBCbits_t;

extern __at(0x01B5) volatile __BD2IBCbits_t BD2IBCbits;

#define _BD2IBC_BC0             0x01
#define _BD2IBC_BC1             0x02
#define _BD2IBC_BC2             0x04
#define _BD2IBC_BC3             0x08

//==============================================================================

extern __at(0x01B6) __sfr BD2IAL;

//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG1                0x2007

//----------------------------- CONFIG1 Options -------------------------------

#define _FOSC_HS                0x3FFC  // HS oscillator.
#define _HS_OSC                 0x3FFC  // HS oscillator.
#define _FOSC_EC                0x3FFD  // External clock. CLKOUT on OSC2 pin.
#define _EC_OSC                 0x3FFD  // External clock. CLKOUT on OSC2 pin.
#define _FOSC_H4                0x3FFE  // HS osc with 4x PLL enabled.
#define _H4_OSC                 0x3FFE  // HS osc with 4x PLL enabled.
#define _FOSC_E4                0x3FFF  // External clock with 4x PLL enabled. CLKOUT on OSC2 pin.
#define _E4_OSC                 0x3FFF  // External clock with 4x PLL enabled. CLKOUT on OSC2 pin.
#define _WDTE_OFF               0x3FFB  // WDT disabled.
#define _WDT_OFF                0x3FFB  // WDT disabled.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FF7  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _CP_ALL                 0x00CF  // All memory is code protected.
#define _CP_75                  0x15DF  // 0800h-1FFFh code protected.
#define _CP_50                  0x2AEF  // 1000h-1FFFh code protected.
#define _CP_OFF                 0x3FFF  // Code protection off.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 2, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 2, shadows bit in ADCON0bits
#define NOT_DONE                ADCON0bits.NOT_DONE             // bit 2, shadows bit in ADCON0bits
#define GO_DONE                 ADCON0bits.GO_DONE              // bit 2, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 3
#define CHS1                    ADCON0bits.CHS1                 // bit 4
#define CHS2                    ADCON0bits.CHS2                 // bit 5
#define ADCS0                   ADCON0bits.ADCS0                // bit 6
#define ADCS1                   ADCON0bits.ADCS1                // bit 7

#define PCFG0                   ADCON1bits.PCFG0                // bit 0
#define PCFG1                   ADCON1bits.PCFG1                // bit 1
#define PCFG2                   ADCON1bits.PCFG2                // bit 2

#define BC0                     BD0IBCbits.BC0                  // bit 0
#define BC1                     BD0IBCbits.BC1                  // bit 1
#define BC2                     BD0IBCbits.BC2                  // bit 2
#define BC3                     BD0IBCbits.BC3                  // bit 3

#define PID0_BSTALL             BD0ISTbits.PID0_BSTALL          // bit 2, shadows bit in BD0ISTbits
#define PID0                    BD0ISTbits.PID0                 // bit 2, shadows bit in BD0ISTbits
#define BSTALL                  BD0ISTbits.BSTALL               // bit 2, shadows bit in BD0ISTbits
#define PID1_DTS                BD0ISTbits.PID1_DTS             // bit 3, shadows bit in BD0ISTbits
#define PID1                    BD0ISTbits.PID1                 // bit 3, shadows bit in BD0ISTbits
#define DTS                     BD0ISTbits.DTS                  // bit 3, shadows bit in BD0ISTbits
#define PID2                    BD0ISTbits.PID2                 // bit 4
#define PID3                    BD0ISTbits.PID3                 // bit 5
#define DATA0_1                 BD0ISTbits.DATA0_1              // bit 6, shadows bit in BD0ISTbits
#define DATA01                  BD0ISTbits.DATA01               // bit 6, shadows bit in BD0ISTbits
#define UOWN                    BD0ISTbits.UOWN                 // bit 7, shadows bit in BD0ISTbits
#define OWN                     BD0ISTbits.OWN                  // bit 7, shadows bit in BD0ISTbits

#define CCP1M0                  CCP1CONbits.CCP1M0              // bit 0
#define CCP1M1                  CCP1CONbits.CCP1M1              // bit 1
#define CCP1M2                  CCP1CONbits.CCP1M2              // bit 2
#define CCP1M3                  CCP1CONbits.CCP1M3              // bit 3
#define DC1B0                   CCP1CONbits.DC1B0               // bit 4
#define DC1B1                   CCP1CONbits.DC1B1               // bit 5

#define CCP2M0                  CCP2CONbits.CCP2M0              // bit 0
#define CCP2M1                  CCP2CONbits.CCP2M1              // bit 1
#define CCP2M2                  CCP2CONbits.CCP2M2              // bit 2
#define CCP2M3                  CCP2CONbits.CCP2M3              // bit 3
#define DC2B0                   CCP2CONbits.DC2B0               // bit 4
#define DC2B1                   CCP2CONbits.DC2B1               // bit 5

#define RBIF                    INTCONbits.RBIF                 // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define T0IF                    INTCONbits.T0IF                 // bit 2, shadows bit in INTCONbits
#define TMR0IF                  INTCONbits.TMR0IF               // bit 2, shadows bit in INTCONbits
#define RBIE                    INTCONbits.RBIE                 // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define T0IE                    INTCONbits.T0IE                 // bit 5, shadows bit in INTCONbits
#define TMR0IE                  INTCONbits.TMR0IE               // bit 5, shadows bit in INTCONbits
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define PS0                     OPTION_REGbits.PS0              // bit 0
#define PS1                     OPTION_REGbits.PS1              // bit 1
#define PS2                     OPTION_REGbits.PS2              // bit 2
#define PSA                     OPTION_REGbits.PSA              // bit 3
#define T0SE                    OPTION_REGbits.T0SE             // bit 4
#define T0CS                    OPTION_REGbits.T0CS             // bit 5
#define INTEDG                  OPTION_REGbits.INTEDG           // bit 6
#define NOT_RBPU                OPTION_REGbits.NOT_RBPU         // bit 7

#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0, shadows bit in PCONbits
#define NOT_BO                  PCONbits.NOT_BO                 // bit 0, shadows bit in PCONbits
#define NOT_POR                 PCONbits.NOT_POR                // bit 1

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define TMR2IE                  PIE1bits.TMR2IE                 // bit 1
#define CCP1IE                  PIE1bits.CCP1IE                 // bit 2
#define USBIE                   PIE1bits.USBIE                  // bit 3
#define TXIE                    PIE1bits.TXIE                   // bit 4
#define RCIE                    PIE1bits.RCIE                   // bit 5
#define ADIE                    PIE1bits.ADIE                   // bit 6

#define CCP2IE                  PIE2bits.CCP2IE                 // bit 0

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0
#define TMR2IF                  PIR1bits.TMR2IF                 // bit 1
#define CCP1IF                  PIR1bits.CCP1IF                 // bit 2
#define USBIF                   PIR1bits.USBIF                  // bit 3
#define TXIF                    PIR1bits.TXIF                   // bit 4
#define RCIF                    PIR1bits.RCIF                   // bit 5
#define ADIF                    PIR1bits.ADIF                   // bit 6

